{"posts":[{"title":"建立免費靜態網站：不懂程式也能理解的GitHub Pages與Hexo介紹","text":"這篇文章在聊什麼： Github、Github Pages、Hexo是什麼？ 程式碼管理平台與一般的雲端硬碟有什麼差異？ 靜態網站建立平台和生成器的區別？ 介紹：Github｜Github Pages｜Hexo GitHub：程式碼管理平台允許開發者在上面儲存和分享程式碼。 GitHub Pages：靜態網站建立平台它是GitHub的一個功能，允許使用者在上面建立和管理靜態網站，並可以免費使用自己的網域名稱。 Hexo：靜態網站生成器基於Node.js開發的網誌框架，可以讓使用者快速製作自己的靜態網站。它使用Markdown語法來編寫內容，並且支援多種主題和插件，使用者可自由發揮並輕鬆地部署到GitHub Pages上。 Q：Github跟雲端硬碟有什麼不同呢？不是都能存放檔案和分享嗎？GitHub與一般的雲端硬碟的差異在於： 它專注於程式碼的版本管理和協作，並提供許多開發者工具和社群功能。 可作為一個程式碼庫，開發者可以在上面尋找和使用開源項目，並與其他開發者進行合作。 打個比方，word和excel都能記帳，但因為excel對於相關功能的特化，使得它更適合這樣的工作場景。 因此GitHub相較於雲端硬碟，更適合開發人員和程式開發專案的管理。 Q：靜態網站建立平台和生成器有什麼差別？要說明兩者間的關係，可以這樣比喻： 靜態網站平台就像是一個展示空間，而靜態網站生成器就像是一位室內設計師。室內設計師可以根據展示空間的大小和形狀，以及客戶的需求和風格，設計出一個獨特的佈局和風格。同樣地，靜態網站生成器可以根據使用者的需求和設計，生成一個獨特的靜態網站，而靜態網站平台則提供了展示這個網站的場所和相應的工具和功能。 下篇來聊聊常用的語法好了…","link":"/uncategorized/Creating-a-Free-Static-Website-Understanding-GitHub-Pages-and-Hexo/"},{"title":"免費、容易上手、高度可定制：使用Github Pages和Hexo創建個人部落格的5大優點","text":"這篇文章在聊什麼： 為什麼會想創部落格？ 為什麼使用Github Pages + Hexo？ 創部落格的理由想要有系統地分享文字、圖片與程式碼，是我創部落格的主要原因。 自從2022年底chatGPT(點我)推出後，學習變得相對容易，其中最讓我有感的是語言，無論是人類語言或程式語言都是，這讓我很興奮地陸續分享了幾篇在Facebook與Instagram上，但內容一長閱讀起來就變得很不方便，尤其涉及程式碼的時候更是如此。 想起自己覺得不錯的程式教學文章大多是以部落格的形式呈現，因此讓我有了創建部落格的念頭。多虧了chatGPT，讓我在實作上遇到的問題都獲得很好的指引或解釋，有機會後續再另闢篇幅說明。 使用Github Pages和Hexo的5個優點 免費 - 使用 Github Pages 創建部落格是免費的，不需要花費額外的費用來購買網域和網站主機，這對於個人和小型團體來說非常實惠。 容易上手 - Hexo 是一個靜態網站產生器，它可以幫助你快速創建部落格並且具有豐富的主題和插件，這些都可以幫助你快速上手並創建出高質量的部落格。 安全可靠 - Github Pages 是由 Github 提供的靜態網站服務，它具有優秀的安全性和穩定性，可以保護你的部落格免受惡意攻擊和崩潰等問題的影響。 容易維護 - 使用 Hexo 創建部落格可以使你更輕鬆地進行部落格維護和更新，它具有自動化的功能，例如生成靜態頁面和部署更新，這可以使你的部落格維護變得更加容易。 高度可定制 - Hexo 具有豐富的主題和插件，這可以使你的部落格擁有獨特的風格和功能，同時你也可以自己創建自己的主題和插件來實現更多的定制化需求。 下篇我們再來聊聊什麼是Github Pages和Hexo吧！","link":"/uncategorized/5-advantages-of-using-Github-Pages-and-Hexo-to-create-a-personal-blog/"}],"tags":[{"name":"github pages","slug":"github-pages","link":"/tags/github-pages/"},{"name":"hexo","slug":"hexo","link":"/tags/hexo/"},{"name":"github","slug":"github","link":"/tags/github/"}],"categories":[],"pages":[{"title":"categories","text":"","link":"/categories/index.html"}]}